## 資料的組合
- pandas.merge()
- pandas.concat()

In [1]:
import pandas as pd
df1 = pd.DataFrame({'key':['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                   'data1':range(7)})

df2 = pd.DataFrame({'key':['a', 'b', 'd'],
                   'data2':range(3)})

display(df1)
display(df2)

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

  key  data2
0   a      0
1   b      1
2   d      2

In [2]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

In [3]:
pd.merge(df1,df2,how='left')

  key  data1  data2
0   b      0    1.0
1   b      1    1.0
2   a      2    0.0
3   c      3    NaN
4   a      4    0.0
5   a      5    0.0
6   b      6    1.0

In [10]:
import os
file_names:list[str] = os.listdir('data')
abs_paths:list[str] = []
for name in file_names:
    if '每日各站' in name :
        print(os.path.abspath(f'data/{name}'))
        abs_paths.append(os.path.abspath(f'data/{name}'))

/workspaces/__2024_01_28_sunday__/lesson20/data/每日各站進出站人數2022.csv
/workspaces/__2024_01_28_sunday__/lesson20/data/每日各站進出站人數20190423-20191231.csv
/workspaces/__2024_01_28_sunday__/lesson20/data/每日各站進出站人數2020.csv
/workspaces/__2024_01_28_sunday__/lesson20/data/每日各站進出站人數2023.csv
/workspaces/__2024_01_28_sunday__/lesson20/data/每日各站進出站人數2021.csv

In [ ]:
for path in abs_paths:
    dataFrame = pd.read_csv(path)

In [28]:
dataFrame_list = [pd.read_csv(path) for path in abs_paths]
df1 = pd.concat(dataFrame_list)
df1.info()
df1

<class 'pandas.core.frame.DataFrame'>
Index: 406761 entries, 0 to 86538
Data columns (total 4 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   trnOpDate        406761 non-null  int64
 1   staCode          406761 non-null  int64
 2   gateInComingCnt  406761 non-null  int64
 3   gateOutGoingCnt  406761 non-null  int64
dtypes: int64(4)
memory usage: 15.5 MB

       trnOpDate  staCode  gateInComingCnt  gateOutGoingCnt
0       20220101      900             8645             8526
1       20220101      910              996             1243
2       20220101      920             1369             1711
3       20220101      930             3663             4535
4       20220101      940             1532             1845
...          ...      ...              ...              ...
86534   20211231     7360             4062             4451
86535   20211231     7361               87              104
86536   20211231     7362              341              403
86537   20211231     7380              534              481
86538   20211231     7390              383              389

[406761 rows x 4 columns]

In [24]:
import requests
from requests import Response
path = 'https://ods.railway.gov.tw/tra-ods-web/ods/download/dataResource/0518b833e8964d53bfea3f7691aea0ee'

response:Response = requests.get(path)
df2 = pd.DataFrame(response.json())

In [ ]:

df2['stationCode'] = df2['stationCode'].astype(int)
df2.info()

df3 = pd.merge(df1,df2,how='left',left_on='staCode',right_on='stationCode')
df3

In [32]:
df3.info()
df4 = df3.reindex(columns=['trnOpDate','name','gateInComingCnt','gateOutGoingCnt'])
df4.columns = ['日期','站名','進站','出站']
df4

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 406761 entries, 0 to 406760
Data columns (total 14 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   trnOpDate        406761 non-null  int64
 1   staCode          406761 non-null  int64
 2   gateInComingCnt  406761 non-null  int64
 3   gateOutGoingCnt  406761 non-null  int64
 4   stationCode      406761 non-null  int64
 5   stationName      406761 non-null  object
 6   stationEName     406761 non-null  object
 7   name             406761 non-null  object
 8   ename            406761 non-null  object
 9   stationAddrTw    406761 non-null  object
 10  stationAddrEn    406761 non-null  object
 11  stationTel       406761 non-null  object
 12  gps              406761 non-null  object
 13  haveBike         406761 non-null  object
dtypes: int64(5), object(9)
memory usage: 43.4+ MB

              日期   站名    進站    出站
0       20220101   基隆  8645  8526
1       20220101   三坑   996  1243
2       20220101   八堵  1369  1711
3       20220101   七堵  3663  4535
4       20220101   百福  1532  1845
...          ...  ...   ...   ...
406756  20211231   瑞芳  4062  4451
406757  20211231  海科館    87   104
406758  20211231  八斗子   341   403
406759  20211231  四腳亭   534   481
406760  20211231   暖暖   383   389

[406761 rows x 4 columns]